Revit 2027 API
FabricationConfiguration.AncillaryExists Method
 Checks to see if the specified ancillary exists.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AncillaryExists(
	int ancillaryId
)
Public Function AncillaryExists (
	ancillaryId As Integer
) As Boolean
public:
bool AncillaryExists(
	int ancillaryId
)
member AncillaryExists :
        ancillaryId : int -> bool
Parameters
ancillaryId Int32
 The ancillary identifier.
Return Value
Boolean
 Returns true if the ancillary exists.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace